import React from "react";
import s from "../lessonsStyle.module.css";
import diagram from "../../assets/img/diagram.jpg";
const ReactHistory = () => {
  return (
    <div>
      <h1>Історія створення React </h1>
      <p>
        React був створений розробниками компанії Facebook для вирішення проблем
        в управлінні складними інтерфейсами із змінними даними. У{" "}
        <span>2011</span> році Марк Цукерберг та його команда Facebook почали
        працювати над мобільним додатком для iOS. Вони стикалися зі складністю
        та повільністю оновлення інтерфейсу з великою кількістю даних.{" "}
      </p>
      <p>
        В результаті була розроблена бібліотека під назвою React, яка вперше
        була внутрішнім інструментом для Facebook. Вона заснована на концепції
        віртуального DOM, де зміни на сторінці не відбуваються відразу в
        реальному DOM, а спершу відбуваються в віртуальному подібному до DOM
        представленні. Після цього React робить ефективний апдейт реального DOM.
        <img
          className={s.text_image_right}
          src="https://www.eltiempo.com/files/article_main_1200/uploads/2022/02/15/620c09222b93a.jpeg"
          alt=""
          style={{ width: "40%", borderRadius: "9px" }}
        />
      </p>
      <p>
        У <span>2013</span> році Facebook випустив React як open-source проект.
        Це дозволило розробникам по всьому світу використовувати і сприймати
        React. Швидко відбулося зростання популярності бібліотеки, і вона стала
        важливим інструментом для створення веб-інтерфейсів.
      </p>
      <p>
        Після цього у React з'явилися нові можливості, такі як компоненти,
        контекст, хуки та багато інших, які роблять розробку великих інтерфейсів
        більш зручною та ефективною. Також з'явились різні додаткові бібліотеки,
        такі як Redux, що допомагають краще управляти станом додатків.
      </p>
      <p>
        Сьогодні React є однією з найпопулярніших бібліотек для розробки
        інтерфейсів, і використовується великою кількістю компаній та
        розробників по всьому світу.
      </p>
      <img src={diagram} alt="" />
      <h5>Рейтинг фрейморків станом на 2023 рік</h5>
    </div>
  );
};

export default ReactHistory;
